# Описати:
# ! Завдання першого рівня
# – елемент хеш-таблиці, який являє собою геометричну фігуру
# відповідно до варіанта (дод. 2, табл. Д2.1, «Клас»);
# – хеш-таблицю з відкритою адресацією, яка використовує
# метод хешування (дod. 2, табл. Д2.1, «Метод хешування») для за-
# даного ключа (дод. 2, табл. Д2.1, «Ключ»);
# 8
# Необхідно:
# – створити екземпляр хеш-таблиці заданого розміру;
# – уставити елементи в хеш-таблицю в такий спосіб, щоб вона
# не мала колізій;
# – вивести вміст хеш-таблиці.


# ! Завдання другого рівня
# Змінити опис хеш-таблиці із завдання першого рівня так, щоб
# у разі виникнення колізії вона вирішувалася методом згідно з варі-
# антом завдання (дод. 2, табл. Д2.2);
# Необхідно:
# – створити екземпляр хеш-таблиці заданого розміру;
# – уставити елементи в хеш-таблицю з урахуванням колізії;
# – вивести вміст хеш-таблиці.

# ! Завдання третього рівня
# Змінити опис хеш-таблиці із завдання другого рівня так, щоб
# видалялися елементи згідно із заданим критерієм (дод. 2, табл.
# Д2.3);
# Необхідно:
# – створити екземпляр хеш-таблиці заданого розміру;
# – уставити елементи в хеш-таблицю з урахуванням колізії та
# вивести вміст хеш-таблиці;
# – видалити елементи за заданим критерієм і вивести вміст
# хеш-таблиці.

# ! Методичні рекомендації
# Елемент хеш-таблиці та сама хеш-таблиця описуються як
# класи. Клас, який являє собою хеш-таблицю, містить одновимірний
# масив та розмір хеш-таблиці, який задається користувачем уведен-
# ням з клавіатури.
# Для створення нового елемента хеш-таблиці координати гео-
# метричної фігури слід задавати з використанням програмного гене-
# ратора випадкових чисел (метод public static double random() класу
# java.lang.Math або методи класу java.util.Random) та перевіряти на
# правильність фігуру з такими координатами.
# Метод класу хеш-таблиці, що реалізовує операцію вставлен-
# ня, для визначення позиції нового елемента хеш-таблиці (масиву),
# 9
# викликає спеціальний метод. Цей метод визначає ключ нового еле-
# мента та обчислює його позицію в масиві за заданим методом хе-
# шування.
# Метод, що реалізовує операцію вставлення, повинен поверта-
# ти логічне значення, яке показує успішність цієї операції. Для за-
# вдання першого рівня значення false повертається у разі, якщо по-
# зиція зайнята і новий елемент у хеш-таблицю додаватися не буде.
# Для завдання другого рівня значення false повертається у разі, як-
# що колізія не вирішується (тільки для хеш-таблиць з відкритою
# адресацією).
# Метод класу хеш-таблиці, який реалізовує операцію виведен-
# ня, виводить хеш-таблицю, розміщуючи на окремому рядку номер
# позиції таблиці, ключ елемента та сам елемент. Якщо елемента в
# позиції немає, то поряд з номером позиції має виводитися відпові-
# дне повідомлення. Для хеш-таблиці з роздільним зв’язуванням в
# окремому рядку слід виводити всі елементи, що зберігаються в
# одній позиції.
# Для наочності роботи програми потрібно форматувати дані,
# що виводяться (метод public format (String format, Object ... args)
# класу java.util.Formatter або метод System.out.printf(String format,
# Object ... args)).
